/*
(i) Код попадает в итоговый файл,
только когда вызвана функция,
например vnvFunctions.spollers();
Или когда импортирован весь файл,
например import "files/script.js";
Неиспользуемый (не вызванный)
код в итоговый файл не попадает.


Если мы хотим добавить модуль
следует его расскоментировать
*/

// Включить/выключить vnv (Full Logging System) (в работе)
window['vnv'] = false;

// Подключение основного файла стилей
import "../scss/style.scss";

// ========================================================================================================================================================================================================================================================
// Функционал ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as vnvFunctions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
vnvFunctions.isWebp();
/* Добавление класса touch для HTML если браузер мобильный */
vnvFunctions.addTouchClass();
/* Добавление loaded для HTML после полной загрузки страницы */
vnvFunctions.addLoadedClass();
/* Модуль для работы с меню (Бургер) */
vnvFunctions.menuInit();
/* Модуль для работы с меню */
vnvFunctions.menu();
/* Модуль для работы с меню выбора и подтверждения региона  */
vnvFunctions.regionMenu();
/* Учет плавающей панели на мобильных устройствах при 100vh */
// vnvFunctions.fullVHfix();

/*
Модуль работы со спойлерами
Документация: https://template.vnv.guru/template-docs/modul-spojlery.html
Сниппет (HTML): spollers
*/
vnvFunctions.spollers();

/*
Модуль работы с табами
Документация: https://template.vnv.guru/template-docs/modul-taby.html
Сниппет (HTML): tabs
*/
vnvFunctions.tabs();

/*
Модуль "показать еще"
Документация: https://template.vnv.guru/template-docs/modul-pokazat-eshhjo.html
Сниппет (HTML): showmore
*/
vnvFunctions.showMore();

/*
Попапы
Документация: https://template.vnv.guru/template-docs/funkcional-popup.html
Сниппет (HTML): pl
*/
import './libs/popup.js'

/*
Модуль параллакса мышью
Документация: https://template.vnv.guru/template-docs/modul-animacii-parallaks-obektov-pri-dvizhenii-myshi.html
*/
import './libs/parallax-mouse.js'

// ========================================================================================================================================================================================================================================================
// Работа с формами ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
import * as vnvForms from "./files/forms/forms.js";

/* Работа с полями формы */
/* Документация: https://template.vnv.guru/template-docs/rabota-s-formami.html */
// vnvForms.formFieldsInit({
// 	viewPass: false,
// 	autoHeight: false
// });

/* Oтправка формы */
/* Документация: https://template.vnv.guru/template-docs/rabota-s-formami.html */
// vnvForms.formSubmit();

/* Модуль формы "колличество" */
// vnvForms.formQuantity();

/* Модуль звездного рейтинга */
vnvForms.formRating();

/* Модуль работы с select. */
// import './libs/select.js'

/* Модуль работы с календарем */
// import './files/forms/datepicker.js'

/* (В работе) Модуль работы с масками.*/
/*
Подключение и настройка выполняется в файле js/files/forms/inputmask.js
Документация по работе в шаблоне:
Документация плагина: https://github.com/RobinHerbots/inputmask
Сниппет(HTML):
*/
// import "./files/forms/inputmask.js";

/* Модуль работы с ползунком */
/*
Подключение и настройка выполняется в файле js/files/forms/range.js
Документация по работе в шаблоне:
Документация плагина: https://refreshless.com/nouislider/
Сниппет (HTML): range
*/
// import "./files/forms/range.js";

/* Модуль работы с подсказками (tippy) */
/*
Подключение плагина Tippy.js и настройка выполняется в файле js/files/tippy.js
Документация по работе в шаблоне:
Документация плагина: https://atomiks.github.io/tippyjs/
Сниппет (HTML): tip (добавляет атрибут с подсказкой для html тега)
*/
// import "./files/tippy.js";

// ========================================================================================================================================================================================================================================================
// Работа со слайдером (Swiper) ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Настройка подключения плагина слайдера Swiper и новых слайдеров выполняется в файле js/files/sliders.js
Документация по работе в шаблоне: https://template.vnv.guru/template-docs/rabota-so-slajderom-swiper.html
Документация плагина: https://swiperjs.com/
Сниппет(HTML): swiper
*/
import "./files/sliders.js";

// ========================================================================================================================================================================================================================================================
// Модули работы с прокруткой страницы ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/*
Изменение дизайна скроллбара
Документация по работе в шаблоне: В HTML добавляем к блоку атрибут data-simplebar
Документация плагина: https://github.com/Grsmto/simplebar/tree/master/packages/simplebar
Сниппет(HTML): 
*/
// import './files/scroll/simplebar.js';

// Ленивая (отложенная) загрузка картинок
// Документация по работе в шаблоне: https://template.vnv.guru/template-docs/modul-lenivaya-podgruzka-lazy-loading.html
// Документация плагина: https://github.com/verlok/vanilla-lazyload
// Сниппет(HTML):
// import './files/scroll/lazyload.js';

// Наблюдатель за объектами c атрибутом data-watch
// Документация: https://template.vnv.guru/template-docs/modul-nabljudatel-za-poyavleniem-elementa-pri-skrolle.html
// Сниппет(HTML):
// import './libs/watcher.js'

// Функции работы скроллом
import * as vnvScroll from "./files/scroll/scroll.js";

// Плавная навигация по странице
// Документация: https://template.vnv.guru/template-docs/modul-plavnoj-navigacii-po-stranice.html
vnvScroll.pageNavigation();

// Функционал добавления классов к хедеру при прокрутке
// Документация: https://template.vnv.guru/template-docs/modul-dobavleniya-klassov-k-shapke-pri-prokrutke-stranicy.html
vnvScroll.headerScroll();

// Функционал липкого блока
// vnvScroll.stickyBlock();

// Модуль поекранної прокрутки
// Документация: https://template.vnv.guru/template-docs/modul-poekrannoj-prokrutki-stranicy-fullpage.html
// Сниппет(HTML):
// import './libs/fullpage.js'


// ========================================================================================================================================================================================================================================================
// Галерея ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/*
Документация по работе в шаблоне: 
Документация плагина: https://www.lightgalleryjs.com/docs/
Сниппет(HTML):
*/
// import "./files/gallery.js";

// ========================================================================================================================================================================================================================================================
// Прочие плагины ============================================================================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================

/* Динамический адаптив */
// Документация: https://template.vnv.guru/template-docs/dinamicheskij-adaptiv.html
// import "./libs/dynamic_adapt.js";

/* Форматирование чисел */
// import './libs/wNumb.min.js';

// ========================================================================================================================================================================================================================================================
// Прочее ========================================================================================================================================================================================================================================================
// ========================================================================================================================================================================================================================================================
/* Подключаем файлы со своим кодом */
import "./files/script.js";
import "./files/project.js";
import "./files/tariff.js";
import "./files/steps.js";
// import "./files/map.js";
import "./libs/imagecompare.js";
import "./libs/nouislider.js";
import "./libs/animation-gsap.js";